Repository: payorch/ios_sdk
Catalog: GeideaPaymentSDK/*.lproj/Localizable.strings
Languages: ar

# CAPTURE_SCREEN_TITLE
source: Processing payment capture..
ar: تسجيل عملية الدفع قيد الإجراء..

# REFUND_SCREEN_TITLE
source: Processing payment refund..
ar: استعادة الدفع قيد الإجراء..

# PAYMENT_SCREEN_TITLE
source: Processing payment..
ar: عملية الدفع قيد الإجراء..

# EInvoice_SCREEN_TITLE
source: EInvoice sample
ar: مثال إيصال الكتروني

# CARD_DETAILS_TITLE
source: Card details
ar: معلومات البطاقة

# PAY_CARD_TITLE
source: Pay with credit card
ar: الدفع عبر بطاقة الائتمان

# CARD_NAME_INVALID
source: ⃰ Wrong card name
ar: الرجاء إدخال الإسم الصحيح

# CARD_NAME_EMPTY
source: ⃰ Please enter name on card
ar: الرجاء إدخال الاسم على البطاقة

# CARD_NUMBER_INVALID
source: ⃰ Wrong card number
ar: ⃰ رقم البطاقة غير صحيح

# CARD_NUMBER_INVALID_LENGTH
source: ⃰ Wrong card number length
ar: ⃰ عدد أرقام البطاقة غير صحيح

# CARD_NUMBER_INCOMPLETE
source: ⃰ Your card number is incomplete
ar: رقم بطاقتك غير مكتمل

# CARD_NUMBER_UNSUPPORTED
source: ⃰ Unsupported card brand
ar: ⃰ نوع بطاقة غير معتمد

# DATE_EXPIRED
source: ⃰ The card has expired
ar: ⃰ انتهت صلاحية البطاقة

# DATE_INVALID
source: ⃰ Wrong expiry date
ar: ⃰ تاريخ الصلاحية غير صحيح

# EMAIL_INVALID
source: ⃰ Wrong email
ar: ⃰ بريد الكتروني غير صحيح

# CVV_INVALID_LENTH
source: ⃰ Wrong CVV length
ar: ⃰ رقم الأمان غير صحيح

source: ⃰ CVV Invalid
ar: رقم الأمان غير صحيح

# CVV_EMPTY
source: ⃰ Please enter the CVV
ar: الرجاء إدخال رقم الأمان

# STREET_INVALID_LENGTH
source: ⃰ Wrong street name and number length
ar: ⃰ طول العنوان ورقم الشارع غير صحيح

# CITY_INVALID_LENGTH
source: ⃰ Wrong city length
ar: ⃰ عدد أحرف اسم المدينة غير صحيح

# POSTCODE_INVALID_LENGTH
source: ⃰ Wrong postcode length
ar: ⃰ عدد أرقام الرمز البريدي غير صحيح

# CVV_HINT
source: Turn your card over and look at the signature box. This 3-code is your CVV number / Card Security Code
ar: اقلب بطاقتك للجهة الأخرى وأنظر على الخانة قرب التوقيع، الرمز المكون من ثلاثة أرقام هو رمز أمان البطاقة

# OK_BUTTON
source: OK
ar: الموافقة

# CANCEL_BUTTON
source: CANCEL
ar: إلغاء

# CANCEL_PAYMENT
source: Are you sure you want to cancel the payment?
ar: هل أنت متأكد أنك تريد إلغاء الدفع؟

# PAY_BUTTON
source: Pay %@ %@
ar: الدفع %@ %@

# CARD_NUMBER_TITLE
source: Card Number
ar: رقم البطاقة

# CARD_NAME_TITLE
source: Name on card
ar: الاسم على البطاقة

# EXPIRY_DATE_TITLE
source: Expiry date
ar: تاريخ انتهاء الصلاحية

# CVV_TITLE
source: CVV
ar: رقم الأمان

# DONE_BUTTON
source: Done
ar: تم

# NEXT_BUTTON
source: Next
ar: التالي

# PAYMENT_TIMEOUT
source: Your payment has timed out
ar: انقضى الوقت المخصص لهذه العملية

# PAYMENT_CANCELLED
source: Cancelled by user
ar: تم إلالغاء من المستخدم

# PAYMENT_UNSUCCESSFUL
source: Your payment was not successful
ar: فشلت عملية الدفع

# OR_PAY_CC
source: Or pay with credit card
ar: أو الدفع عبر بطاقة الائتمان

source: Email
ar: البريد الالكتروني

source: Country
ar: البلد

source: City
ar: المدينة

# STREET_NAME
source: Street name and number
ar: اسم ورقم الشارع

source: Postcode
ar: الرمز البريدي

source: Billing Address
ar: عنوان الفوترة

source: Shipping Address
ar: عنوان التوصيل

# SAME_BILLING_SHIPPING
source: Shipping address is same as Billing address
ar: عنوان الفوترة هو نفس عنوان التوصيل

# QR_EXPIRY_DATE_TITLE
source: Expiry date
ar: تاريخ انتهاء الصلاحية

# QR_SCAN_PAY_TITLE
source: Scan and Pay
ar: المسح والدفع

# QR_MERCHANT_NAME_TITLE
source: Merchant name
ar: اسم التاجر

# QR_REQUEST_PAY_TITLE
source: Can't scan QR code?
ar: لا تستطيع مسح الرمز الشريطي؟

# QR_REQUEST_PAY_DESCRIPTION
source: Send payment request to customer's mobile number
ar: ارسل طلب الدفع لجوال العميل

# QR_PAYMENT_BUTTON
source: Request payment
ar: اطلب الدفع

# RQ_REQUEST_ALERT_TITLE
source: Enter MeezaDigital ID / Mobile number
ar: قم بإدخال هوية ميزة رقم الجوال

# QR_REQUEST_TEXT_PLACEHOLDER
source: MeezaDigital ID / Mobile number
ar: هوية ميزة رقم الجوال

# QR_REQUEST_PAYMENT_BUTTON
source: Send
ar: إرسال

# QR_MOBILE_WALLET_TITLE
source: Mobile Wallet Payment
ar: الدفع بمحفظة الهاتف المحمول

# QR_WAITING_TITLE
source: We are waiting for you
ar: نحن في انتظارك

# QR_OPEN_NOTIF_TITLE
source: Open the notification from your wallet application and follow the instructions in order to finalize the payment
ar: افتح الإشعار من تطبيق محفظتك واتبع التعليمات لإنهاء عملية الدفع

# QR_REFRESH_TITLE
source: Do not refresh or close this page
ar: ا تحدّث هذه الصفحة أو تغلقها

# QR_NO_NOTIF_TITLE
source: Didn't receive a notification?
ar: ألم تتلقَ إشعاراً؟

# QR_SCAN_TITLE
source: Scan the QR code using your wallet application to initiate the payment.
ar: امسح رمز الاستجابة السريعة QR باستخدام تطبيق محفظتك لبدء عملية الدفع.

# QR_FAILED_TITLE
source: Your payment was not successful
ar: خطأ في عملية الدفع

# PAYMENT_SELECTION_TITLE
source: Let’s find out your payment method
ar: دعنا نتعرف على طريقة الدفع الخاصه بك

# PAYMENT_SELECTION_OR
source: Or select one of these payment methods
ar: أو الاختيار من بين طرق الدفع التالية

# PAYMENT_SELECTION_QR_CODE
source: Mobile Wallet
ar: محفظة الجوّال

# PAYMENT_SELECTION_CARD
source: Credit / Debit card
ar: البطاقة

# PAYMENT_SELECTION_BNPL
source: Buy Now Pay Later
ar: اشترى الآن و ادفع لاحقاً

# PAYMENT_SELECTION_SHOW_ALL
source: Show all
ar: عرض الكل

# RECEIPT_DATE
source: Date / Time
ar: التاريخ الوقت

# RECEIPT_OPERATION
source: Operation
ar: العملية

# RECEIPT_ORDER_ID
source: Geidea order ID
ar: رقم طلب جيديا

# RECEIPT_MREF_ID
source: Merchant Reference ID
ar: الرقم المرجعي للتاجر

# RECEIPT_MOBILE
source: Mobile No/ Merchant ID
ar: رقم الجوال هوية التاجر

# RECEIPT_USERNAME
source: Username
ar: اسم المستخدم

# RECEIPT_MEEZA_ID
source: Meeza Transaction ID
ar: رقم العملية من ميزة

# RECEIPT_FAILURE_REASON
source: Failure Reason
ar: سبب الفشل

# RECEIPT_BACK_TO
source: Go To Merchant App
ar: زياة تطبيق التاجر

# RECEIPT_APPROVED
source: Transaction approved
ar: الموافقة على العملية

# RECEIPT_FAILED
source: Transaction failed
ar: فشلت العملية

# RECEIPT_TOTAL
source: TOTAL
ar: المجموع

# RECEIPT_REDIRECT
source: You will be redirected automatically to merchant app after 15 sec
ar: سيتم تحويلك لتطبيق التاجر خلال 15 ثانية

# PAYMENT_SELECTION_VAL_U
source: ValU Installments
ar: أقساطأقساط ValU

# PAYMENT_SELECTION_SOUHOOLA
source: Souhoola Installments
ar: أقساط سهولة

# PAYMENT_SELECTION_SHAHRY
source: Shahry Installments
ar: أقساط شهري

# INSTALLMENT_STEP_PHONE_TITLE
source: Confirm your phone number
ar: تأكيد رقم الهاتف

# INSTALLMENT_STEP_INSTALLMENT_TITLE
source: Choose your preffered instalment plan
ar: اختر خطة التقسيط المفضلة

# INSTALLMENT_STEP_PAYMENT_TITLE
source: Process Down Payment
ar: عملية دفع المقدم

# INSTALLMENT_STEP_OTP_TITLE
source: Fill in the One-time Password
ar: أدخل رمز OTP

# INSTALLMENT_INSTALLMENT_PLANS
source: Installment Plans
ar: خطط التقسيط

# INSTALLMENT_PAY_UPFRONT
source: Pay upfront
ar: الدفع مقدما

# INSTALLMENT_PURCHASE_FEES
source: Purchase Fees
ar: رسوم الشراء

# INSTALLMENT_TOTAL_AMOUNT_UPFRONT
source: Total amount to be paid upfront
ar: إجمالي المبلغ المطلوب دفعه مقدماً

# INSTALLMENT_CONFIRM_FINAL
source: Finalize purchase
ar: إتمام الشراء

# INSTALLMENT_AMOUNT_VALUE
source: %@ %@/month (may slightly vary)
ar: شهر، (شهور،)/%@ %@

# PHONE_NUMBER_LABEL
source: Phone number
ar: رقم الهاتف

# PHONE_NUMBER_INVALID
source: * Phone number is invalid
ar: * رقم الهاتف غير صحيح

# VALU_FOOTER_CALL
source: Please call 16671 for any inquiries. Thank you for using valU
ar: يرجى الاتصال برقم 16671 لأية استفسارات. شكراً على استخدام valU

# CASH_PAYMWENT_OPTION
source: Pay %@ %@ in cash at delivery
ar: ادفع %@ %@ نقداً عند التوصيل

# CARD_PAYMWENT_OPTION
source: Pay %@ %@ now, online
ar: ادفع %@ %@ الآن عبر الإنترنت

# CHOOSE_HOW_PAY
source: Choose how you want to pay for the down payment and purchase fees
ar: اختر الطريقة التي توّد الدفع عبرها للدفعة الأولى ورسوم الشراء

# SOUHOOLA_TITLE
source: Your purchase with Souhoola has been confirmed
ar: تم تأكيد عملية شرائك مع سهولة

# VALU_TITLE
source: Your purchase with valU has been confirmed
ar: الشراء مع ValU تم التاكيد

# SHAHRY_TITLE
source: Your purchase with Shahry has been confirmed
ar: تم تأكيد طلبك مع شهري بنجاح

source: Total Amount
ar: المبلغ الإجمالي

source: Financed Amount
ar: المبلغ الممول

source: Installment Amount
ar: مبلغ القسط

source: Down Payment
ar: المقدم / مبلغ تحت الحساب

source: To U Balance
ar: رصيد To-U

source: Cashback Amount
ar: مبلغ الاسترداد النقدي

source: Tenure
ar: فترة،

source: months
ar: شهور،

source: month
ar: شهر،

# SHAHRY_REFERENCE_ID
source: Shahry order ID
ar: رقم الطلب من شهري

# INSTALLMENT_STEP_CONFIRM_SHAHRY_TITLE
source: Confirm your Shahry ID
ar: تأكيد رقم حسابك مع شهري

# INSTALLMENT_STEP_SHAHRY_PURCHASE_TITLE
source: Confirm purchase with Shahry
ar: تأكيد عملية الشراء مع شهري

# CUSTOMER_ID_INVALID
source: Only alphanumeric values allowed, maximum 255 characters
ar: يسمح فقط بالقيم الأبجدية الرقمية ، بحد أقصى 255 حرفًا

source: Shahry ID
ar: رقم حساب شهري

# SHAHRY_WHERE_TO_FIND
source: Where can I find my Shahry ID?
ar: كيف يمكنني معرفة رقم حسابي مع شهري؟

# SHAHRY_LEARN_MORE
source: Learn more about Shahry
ar: اعرف المزيد عن شهري

# SHAHRY_CONFIRM_TERMS
source: By clicking “Confirm” I hereby accept the installment plan terms of this purchase and the refund policy provided by %@
ar: عبر الضغط على ”الموافقة” أنت تقبل بشروط خطة التقسيط لهذا الطلب وبسياسة الإرجاع المزوّدة من قبل %@

# SHAHRY_CONFIRM_BTN
source: Confirm
ar: تأكيد

# SHAHRY_PROCEED_BTN
source: Proceed to Down Payment
ar: عملية دفع المقدم

# SHAHRY_PROCEED_CASH_BTN
source: Proceed
ar: الإكمال

# SHAHRY_ORDER_TOKEN
source: Order Token
ar: اطلب رمز

# SHAHRY_OPEN_TITLE
source: Open your
ar: افتح

# SHAHRY_APP_TITLE
source: Shahry APP
ar: تطبيق شهري

# SHAHRY_TO_COMPLETE
source: to complete your last step by choosing an installment plan then paste/write your order taken here to complete your purchase.
ar: لإكمال الخطوة الأخيرة باختيار خطة تقسيط ثم قم بنسخ ولصق طلبك من هنا لإكمال عملية الشراء.

# SHAHRY_NEED_HELP
source: Need help?
ar: تحتاج لمساعدة؟

# SHAHRY_INVALID_ORDER_TOKEN
source: Invalid Shahry Order Token
ar: رمز الطلب من شهري غير صالح

# VALUE_INSTALLMENT_AMOUNT
source: Total amount needs to be at least %@ %@ in order to pay with valU in installment
ar: يجب ألا يقل المبلغ الإجمالي عن 500 جنيه مصري للدفع بالتقسيط بواسطة valU.

# SOUHOOLA_INSTALLMENT_AMOUNT
source: Total amount needs to be at least %@ %@ in order to pay with Souhoola in installment
ar: يجب ألا يقل المبلغ الإجمالي عن 1000 جنيه مصري للدفع بالتقسيط بواسطة سهولة.

# INSTALLMENT_STEP_CONFIRM_SOUHOOLA_TITLE
source: Confirm your phone number and PIN
ar: مبلغ القسط تقريبى , المبلغ المؤكد سيعرض فى شاشة مراجعة المعامله

# INSTALLMENT_SOUHOOLA_RANGE
source: * Down payment needs to be between %@ and %@
ar: * الدفعة الأولى يجب أن تكون بين %@ جنيه و%@ جنيه

# REVIEW_SOUHOOLA_SCREEN_TITLE
source: Review Purchase Summary
ar: مراجعة ملّخص الشراء

source: Souhoola Order Id
ar: رقم الطلب من سهولة

# SOUHOOLA_PIN_TITLE
source: PIN
ar: الرمز السري

# REGISTER_HERE_TITLE
source: Register here
ar: سجل هنا

# ACCOUNT_TITLE
source: Don't have an account?
ar: ليس لديك حساب؟

source: Purchase details
ar: معلومات الشراء

# TOTAL_ITEMS_CART
source: Total Items in Cart
ar: مجموع الأغراض في العربة

source: First Installment Date
ar: تاريخ القسط الأوّل

source: Down payment limits violated
ar: لم يتم العثور على حساب التاجر

# APROX_INSTALLMENT
source: The installment amount is approximate ; the actual amount will be shown in the review transaction screen
ar: مبلغ القسط تقريبى , المبلغ المؤكد سيعرض فى شاشة مراجعة المعامله

# FINANCED_AMOUNT_ERROR
source: Financed amount needs to be at least %@ %@ in order to purchase with Souhoola in installments
ar: يجب ان يكون المبلغ الممول على الاقل %@ %@ لطلب الشراء بأقساط سهولة

# INSTALLMENT_OTP_DESCRIPTION
source: Your One Time Password has been sent to the registered phone number. Please enter the number below and tap on Finalize purchase button.
ar: تم إرسال رمز OTP إلى رقم الهاتف المسجل لدينا. يرجى إدخال كلمة السر أدناه والضغط على زر إتمام الشراء

# INSTALLMENT_OTP_RESEND_TITLE
source: Didn’t get the OTP?
ar: لم تستلم رمز OTP؟

# INSTALLMENT_OTP_RESEND_BUTTON
source: Resend Code
ar: إعادة إرسال الرمز

# INSTALLMENT_OTP_ATTEMPTS
source: Attempts Left:
ar: المحاولات الباقية:

# INSTALLMENT_OTP_SECONDS
source: seconds
ar: ثواني

# CVV_ENTER
source: Enter your CVV code below
ar: قم بإدخال رمز الأمان أدناه

# CVV_SCREEN_TITLE
source: Please enter your card verification code
ar: لرجاء إدخال رقم التحقق من البطاقة

# CVV_CARD_EXPIRE
source: Expires %@ %@
ar: تنتهي الصلاحية في %@ %@
